app/views/articles/show.html.erb

<p><%= @article.body %></p>
<h3>Comments (<%= @article.comments.size %>) | Views: ( <%= @article.view_count %> )</h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]