app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Ganda"], ["body", "Teste ayoh"], ["created_at", 2016-08-04 17:40:26 UTC], ["updated_at", 2016-08-04 17:40:26 UTC]]
---
	def create
		@article = Article.new(articles_params)
		@article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "beast.png"], ["image_content_type", "image/png"], ["image_file_size", 27720], ["image_updated_at", 2016-08-05 15:40:21 UTC], ["updated_at", 2016-08-05 15:40:21 UTC], ["id", 1]]
---
	def update
		@article = Article.find(params[:id])
		@article.update(articles_params)